import { BASE_API } from '@/config/base';

/**
 * axios 默认配置
 */
export const AXIOS_DEFAULT_CONFIG = {
  baseURL: BASE_API,
  timeout: 20000,
};

export const API_DEFAULT_CONFIG = {
  mockBaseURL: '',
  mock: false,
  debug: false,
};

export const CONST_DEFAULT_CONFIG = {
  sep: '/',
};


interface Code {
  [key: number]: string;
}
export const httpCode: Code = {
  200: '请求已成功',
  201: '请求已经被实现，而且有一个新的资源已经依据请求的需要而创建',
  202: '已接受用于处理，但处理尚未完成',
  203: '非权威信息',
  204: '服务器成功处理了请求，没有返回任何内容',
  205: '服务器成功处理了请求，要求请求者重置内容',
  206: '服务器已经成功处理了部分GET请求',
  207: '多状态',
  208: '已经被报告',
  226: '服务器已经满足了对资源的请求，对实体请求的一个或多个实体操作的结果表示',
  300: '多个选择',
  301: '被请求的资源已永久移动到新位置',
  302: '临时重定向',
  303: '对应当前请求的响应可以在另一个URI上被找到',
  304: '资源未被修改',
  305: '被请求的资源必须通过指定的代理才能被访问',
  306: '后续请求应使用指定的代理',
  307: '临时重定向',
  308: '永久重定向',
  400: '客户端错误',
  401: '未认证',
  402: '需要支付',
  403: '服务器已经理解请求，但是拒绝执行它',
  404: '请求所希望得到的资源未被在服务器上发现',
  405: '请求行中指定的请求方法不能被用于请求相应的资源',
  406: '请求的资源的内容特性无法满足请求头中的条件',
  407: '客户端必须在代理服务器上进行身份验证',
  408: '客户端请求超时',
  409: '请求存在冲突无法处理该请求',
  410: '请求的资源不再可用',
  411: '没有定义Content-Length',
  412: '先决条件错误',
  413: '请求实体过大',
  414: '请求URI过长',
  415: '不支持的媒体类型',
  416: '无法满足请求的范围',
  417: 'Expect字段无法满足',
  418: `I'm a teapot`,
  420: 'Enhance Your Caim',
  421: '被误导的请求',
  422: '不可处理的实体',
  423: '资源被锁定',
  424: '失败的依赖',
  425: 'Unodered Cellection',
  426: '客户端应当切换到TLS/1.0，并在HTTP/1.1 Upgrade header中给出',
  428: '需要满足先决条件',
  429: '过多请求',
  431: '请求头部字段过大',
  444: '无响应',
  450: '被Windows家庭控制阻止',
  451: '访问因法律的要求而被拒绝',
  494: '请求头部过大',
  500: '服务器内部错误',
  501: '服务器不支持当前请求所需要的功能',
  502: '网关或代理执行失败',
  503: '服务不可用',
  504: '网关超时',
  505: '不支持的HTTP版本',
  506: 'Variant Also Negotiates',
  507: '服务器无法存储完成请求所必须的内容',
  508: '服务器在处理请求时陷入死循环',
  510: '获取资源所需要的策略并没有被满足',
  511: '客户端需要进行身份验证才能获得网络访问权限',
};
